"use strict";

/////////////////////////////////////////////////////
// Conditions
/////////////////////////////////////////////////////

let num1 = prompt("Введите число");
num1 = Number(num1);
if (!isNaN(num1)) {
  if (!(num1 % 5)) {
    alert(`${num1} делится на 5`);
  } else {
    alert(`${num1} не делится на 5`);
  }

  if (!(num1 % 3)) {
    alert(`${num1} делится на 3`);
  } else {
    alert(`${num1} не делится на 3`);
  }

  if (!(num1 % 2)) {
    alert(`${num1} делится на 2`);
  } else {
    alert(`${num1} не делится на 2`);
  }
} else {
    alert {"Не является числом"};
}
